# GetAllParameters Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Subelement..::..GetAllParameters Method
Subelement Class See Also
---
Returns all parameters of this subelement.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public IList<ElementId> GetAllParameters()
```

Visual Basic
---
```text
Public Function GetAllParameters As IList(Of ElementId)
```

Visual C++
---
```text
public:
IList<ElementId^>^ GetAllParameters()
```

# See Also
Subelement Class
Autodesk.Revit.DB Namespace